#my_list = [0, 1, 0, 12, 3] #-> [1, 12, 3, 0, 0]
#my_list = [0] #-> [0]
#my_list = [1, 0, 13, 0, 0, 0, 5] #-> [1, 13, 5, 0, 0, 0, 0]
my_list = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] #-> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

tm_list = []

while my_list.count(0):                             # ітеруємо поки в списку є 0
    my_list.remove(0)                               # удаляємо із списку 0
    tm_list.append(0)                               # создаємо тимчасовий список з 0
my_list[len(my_list):len(my_list)] = tm_list[:]     # додаємо тимчасовий список в кінець списку list
print(my_list)
