import string
print('Введить речення для перетворення в хештег.\n')
my_str = input()
# послідовність перетворення в хештег
# 1) робимо всі строчні
# 2) перші сімволи слів переводимо в верхній регистр
# 3) удяляємо пробіли на кінцях речення
# 4) удяляємо пробіли між словами
# 5) удяляємо всі знаки пунктуації
# 6) додаємо символ '#' в початок
# 7) перевіряемо чи строка не більше 140 символів
my_str = my_str.lower().title().strip().replace(' ', '')
for ch in string.punctuation:
    my_str = my_str.replace(ch, '')
my_str = '#' + my_str
if len(my_str) > 140:
    my_str = my_str[:140]
print(my_str)
print('Довжина хештегу: {}'.format(len(my_str)))